app/views/devise/registrations/new.html.erb

    <%= f.label :Compañia, class:"form-control" %>
    <%= f.select :company,@companies.map{ |r| [r.nombre, r.id] },class:"form-control"%>
---
SELECT "companies".* FROM "companies"