app/views/companies/tecnicos.html.erb

    <div class="field form-control"><%="Email : #{tecnico.email}"%></div>
    <%company = Company.find(tecnico.company_id)%>
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 4]]