app/views/companies/usuarios.html.erb

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 5]]
---
    <div class="field form-control"><%="Email : #{usuario.email}"%></div>
    <%company = Company.find(usuario.company_id)%>