app/controllers/companies_controller.rb

   def index
       @companies = Company.all
---
SELECT "companies".* FROM "companies"

    def usuarios
       @usuarios = User.where("permission_level = 1")
---
SELECT "users".* FROM "users" WHERE (permission_level = 1)

    def tecnicos
       @tecnicos = User.where("permission_level = 2")
---
SELECT "users".* FROM "users" WHERE (permission_level = 2)

    def create
        #hasta strong params
        @company = Company.new(company_params)
        @company.valid?
        if @company.save
---
INSERT INTO "companies" ("nombre", "rfc", "razon_social", "telefono", "contacto", "nomenclatura", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

    def update
        if @company.update(company_params)
---
UPDATE "companies" SET "contacto" = $1, "updated_at" = $2 WHERE "companies"."id" = $3  [["contacto", "trololo"], ["updated_at", "2016-09-14 17:55:39.028840"], ["id", 3]]

    def set_company
        @company = Company.find(params[:id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", nil]]