app/controllers/registrations_controller.rb

  def new
    @companies = Company.all.sort_by{|e| e[:nombre]}
---
SELECT "companies".* FROM "companies"

  def create
    @companies = Company.all.sort_by{|e| e[:nombre]}
    @user = User.new(email: params[:user][:email], password: params[:user][:password], password_confirmation: params[:user][:password_confirmation],last_name: params[:user][:last_name],first_name: params[:user][:first_name],permission_level: params[:user][:permission_level])
    @user.company = Company.find(params[:user][:company])

    if @user.save
---
SELECT "companies".* FROM "companies"
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "users" ("email", "encrypted_password", "last_name", "first_name", "permission_level", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "users" SET "last_sign_in_at" = $1, "current_sign_in_at" = $2, "last_sign_in_ip" = $3, "current_sign_in_ip" = $4, "sign_in_count" = $5, "updated_at" = $6 WHERE "users"."id" = $7