app/controllers/reports_controller.rb

    def show
        if @report.tecnico != nil
        @tecnico = User.find(@report.tecnico)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 5]]

    def creadosUsuario
        @reports = Report.recibidos.ultimos.where("user_id = ?",current_user.id)
---
SELECT  "reports".* FROM "reports" WHERE "reports"."id" = $1 LIMIT 1  [["id", nil]]

    def historialUsuario
        @reports = Report.resueltos.en_orden.where("user_id = ?",current_user.id)
---
SELECT  "reports".* FROM "reports" WHERE "reports"."id" = $1 LIMIT 1  [["id", nil]]

    def create
        #hasta strong params
        @report = current_user.reports.new(report_params)
        @report.valid?
        if @report.save
---
INSERT INTO "reports" ("prioridad", "descripcion", "point_of_t", "problem", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def edit
        @tecnicos = User.where("permission_level = 2").sort_by{|e| e[:last_name]}
---
SELECT "users".* FROM "users" WHERE (permission_level = 2)

    def update
        @tecnicos = User.where("permission_level = 2").sort_by{|e| e[:last_name]}
        if @report.update(report_params)
---
SELECT "users".* FROM "users" WHERE (permission_level = 2)
UPDATE "reports" SET "state" = $1, "updated_at" = $2 WHERE "reports"."id" = $3  [["state", "asignado"], ["updated_at", "2016-09-13 23:27:14.225692"], ["id", 5]]

    def set_report
        @report = Report.find(params[:id])
---
SELECT  "reports".* FROM "reports" WHERE "reports"."id" = $1 LIMIT 1  [["id", nil]]