app/views/reports/edit.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 7]]
---
<div class="field">
    <div class="form-control"><%=@report.user.first_name%> <%=@report.user.last_name%></div>