app/views/reports/show.html.erb

<div class="field">
    <div class="form-control"><%="Usuario :  #{@report.user.first_name} #{@report.user.last_name}"%></div>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 7]]